[
    {"heading":"What is a halal stock investment?","subheading01":"Investment refers to allocating money to generate a profitable return over specific periods. Investing in stock means owning a share of a particular company. Thus, it allows you to have a portion of its assets and profits. Diversification is an essential strategy in investment. It is because not every stock has an upward trend over time. We need to spread risks across companies in different industries and at various stages of growth.","subheading02":"Meanwhile, Muslims also should pay close attention to whether or not a stock is halal. A stock is halal if it complies with the principles of Shariah laws. Among these principles are the company does not receive (interest) and its business does not carry out on commodities prohibited by Shariah.","subheading03":"Figuring out the Shariah compliance of a stock is not an easy job. You must follow a particular method and go deep into the financial analysis. Using a halal stock screener like Musaffa will help you at best. The platform will provide you with various relevant information."},
    {"heading":"What stocks can do for your personal finance?","subheading01":"Personal finance is a matter of financial goals. In this case, investing in halal stocks can help you to achieve those goals. Owning stocks will give you the potential to share in the profit of the most successful companies in the world. We can use stocks as one of the main tools to grow our savings and plan for long-term financial goals. An increase in stock prices means an increase in your saving balance","subheading02":"Meanwhile, it is important to note that owning stocks take risks. There is no guarantee that our investment will always be at a profit. Its prices can go down and sometimes lose all of its values.","subheading03":"Furthermore, investing in halal stocks is the primary way to diversify your investment portfolio. It’s because different economic sectors thrive at different times. To mitigate risk, we need to buy different stocks in various sizes of companies in a wide variety of industries. With diversification, we will enjoy gaining thriving sectors while offsetting losses in others"}
]